Revit API Introduction Labs
LabUtils.GetFamilySymbols Method
 Return all family symbols in the active document matching the given built-in category.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static FilteredElementCollector GetFamilySymbols(
	Document doc,
	BuiltInCategory bic
)
Visual Basic (Declaration)
Public Shared Function GetFamilySymbols ( _
	doc As Document, _
	bic As BuiltInCategory _
) As FilteredElementCollector
Visual C++
public:
static FilteredElementCollector^ GetFamilySymbols(
	Document^ doc,
	BuiltInCategory bic
)
Parameters
doc
Type: Document
bic
Type: BuiltInCategory
See Also
LabUtils Class
Labs Namespace